Documents/ЗаявлениеРасчетВФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаявлениеРасчетВФСС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСФондамиПоПособиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеРабочегоОрганаФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>135</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФССНесчСлучай</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МФОБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявленийИРеестровНаВыплатуПособий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявлениеСоставил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФондСоциальногоСтрахования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбязательногоСтрахованияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДиректораФонда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКВЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСоставителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФССУ</Name>
					<Comment>Номер регистрации ФСС Украины</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Comment>Документ, который зарегистрировал начисление</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументыОснованияЗаявлениеРасчетВФСС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПособияВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФикс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБольничного</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаНетрудоспособности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныНетрудоспособности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПособияВсегоФСС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВсегоФСС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛьготыЧернобыльцы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПособияНаПогребение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Comment>Документ, который зарегистрировал начисление</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументыОснованияЗаявлениеВФССОВозмещенииРасходовНаПогребение</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерПособия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФикс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксРасчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтороннееЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПособиеСтороннемуЛицу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НастройкаРасчетовСФондамиПоПособиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкаРасчетовСФондамиПоПособиям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФондСоциальногоСтрахования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбязательногоСтрахованияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пособие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсобыхНачисленийИУдержаний</v8:Type>
						<v8:Type>cfg:EnumRef.ПричиныНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявлениеРасчетВФСС/Ext/ObjectModule.bsl
#Если Не ТолстыйКлиентУправляемоеПриложение Или Сервер Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "ФизическиеЛица.ФизическоеЛицо");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
		
	РегламентированнаяОтчетность.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	Для Каждого СтрокаПогребение Из ПособияНаПогребение Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаПогребение.Сотрудник) И НЕ СтрокаПогребение.ПособиеСтороннемуЛицу Тогда
			ТекстОшибки = НСтр("ru='Не заполнен сотрудник';uk='Не заповнений співробітник'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.ПособияНаПогребение[%1].%2", СтрокаПогребение.НомерСтроки-1, "Сотрудник"),, Отказ);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПогребение.СтороннееЛицо) И СтрокаПогребение.ПособиеСтороннемуЛицу Тогда
			ТекстОшибки = НСтр("ru='Не заполнено физическое лицо';uk='Не заповнена фізична особа'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.ПособияНаПогребение[%1].%2", СтрокаПогребение.НомерСтроки-1, "СтороннееЛицо"),, Отказ);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектЗафиксирован() Экспорт
	
	Возврат НЕ ПрямыеВыплатыПособийСоциальногоСтрахования.СтатусПозволяетРедактироватьДокумент(СтатусДокумента);
	
КонецФункции 

Функция ОбновитьВторичныеДанныеДокумента(ДанныеОрганизации = Истина, ДанныеОплат = Истина, МассивОплат = Неопределено) Экспорт
	
	Модифицирован = Ложь;
	
	Если ОбъектЗафиксирован() Тогда
		Возврат Модифицирован;
	КонецЕсли;
	
	Если ДанныеОрганизации И ОбновитьДанныеСтрахователя() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ДанныеОплат И ОбновитьДанныеОплат(МассивОплат) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Возврат Модифицирован
	
КонецФункции

Функция ОбновитьДанныеСтрахователя()
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаРеквизиты = "НомерФССУ,НомерФСС,НомерФССНесчСлучай,НазваниеРабочегоОрганаФонда,ФИОДиректораФонда,КодПоЕДРПОУ,КодКВЕД,Руководитель,ДолжностьРуководителя,ГлавныйБухгалтер,ТелефонСоставителя,АдресОрганизации";
	СтрокаРеквизиты = СтрокаРеквизиты + ",Банк,НаименованиеБанка,НомерЛицевогоСчета,НомерСчета,МФОБанка";
	РеквизитыДокумента = Новый Структура(СтрокаРеквизиты);
	
//++ ЕРП ЗИК
	СтрокаРеквизитыОрганизации = "НомерФССУ,НомерФСС, НомерФССНесчСлучай, НазваниеРабочегоОрганаФонда,ФИОДиректораФонда,КодПоЕДРПОУ,КодКВЕД";
//~	СтрокаРеквизитыОрганизации = "КодПоЕДРПОУ";
//-- ЕРП ЗИК
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, СтрокаРеквизитыОрганизации);
	
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, РеквизитыОрганизации, СтрокаРеквизитыОрганизации);
	
	ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ДолжностьРуководителя,ГлавныйБухгалтер", Организация);
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
	ЗаполняемыеЗначения.Свойство("Руководитель", РеквизитыДокумента.Руководитель);
	ЗаполняемыеЗначения.Свойство("ДолжностьРуководителя", РеквизитыДокумента.ДолжностьРуководителя);
	ЗаполняемыеЗначения.Свойство("ГлавныйБухгалтер", РеквизитыДокумента.ГлавныйБухгалтер);
	
	
	ДатаПолученияСведений = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	ТаблицаКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Организация,
		Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
		ДатаПолученияСведений,
		Ложь);
	Если ТаблицаКонтактнойИнформации.Количество() > 0 Тогда
		РеквизитыДокумента.АдресОрганизации = ТаблицаКонтактнойИнформации[0].Значение;
	Иначе
		РеквизитыДокумента.АдресОрганизации = "";
	КонецЕсли;
	
	ТаблицаКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Организация,
		Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,
		ДатаПолученияСведений,
		Ложь);
	Если ТаблицаКонтактнойИнформации.Количество() > 0 Тогда
		РеквизитыДокумента.ТелефонСоставителя = ТаблицаКонтактнойИнформации[0].Значение;
	Иначе
		РеквизитыДокумента.ТелефонСоставителя = "";
	КонецЕсли;

	Запрос = ПрямыеВыплатыПособийСоциальногоСтрахования.ЗапросПоСтрокеПолей(СтрокаРеквизиты);
	
	ЗаполнитьЗначенияСвойств(Запрос.Параметры, РеквизитыДокумента); 
	
	Запрос.Выполнить();
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьВторичныеДанные(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект);
	
КонецФункции

Функция ОбновитьДанныеОплат(МассивОплат = Неопределено)
	
	Если ОбъектЗафиксирован() Тогда
		Возврат Ложь;
	КонецЕсли;
	ДанныеОплат = ПрямыеВыплатыПособийСоциальногоСтрахования.ДанныеЗаполненияЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов(Месяц, ФондСоциальногоСтрахования, Организация, , Ссылка, ,РежимЗаполнения);
	
	Если ДанныеОплат = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("ДанныеОплат", ДанныеОплат.Выгрузить());
	Запрос.УстановитьПараметр("МассивОплат", ?(МассивОплат = Неопределено, Оплаты.Выгрузить().ВыгрузитьКолонку("ДокументОснование"), МассивОплат));
	
	ОписаниеФиксацииРеквизитов = Документы.ЗаявлениеРасчетВФСС.ПараметрыФиксацииВторичныхДанных().ОписаниеФиксацииРеквизитов;
	
	ИмяГруппыОписания = "Оплаты";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСтрок.ДокументОснование КАК ДокументОснование,";
	Для каждого ОписаниеРеквизита Из ОписаниеФиксацииРеквизитов Цикл
		Если ОписаниеРеквизита.Значение.ИмяГруппы <> ИмяГруппыОписания Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|	ДанныеСтрок." + ОписаниеРеквизита.Значение.ИмяРеквизита + " КАК " + ОписаниеРеквизита.Значение.ИмяРеквизита + ",";
	КонецЦикла;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(Запрос.Текст, 1);
	
	Запрос.Текст = Запрос.Текст + "
	|ПОМЕСТИТЬ ВТВторичныеДанные
	|ИЗ
	|	&ДанныеОплат КАК ДанныеСтрок
	|ГДЕ
	|	ДанныеСтрок.ДокументОснование В(&МассивОплат)";
	
	Запрос.Выполнить();
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьВторичныеДанные(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект, "Оплаты");
	
КонецФункции

Процедура ЗаполнитьДокументОплаты(СписокСотрудников) Экспорт
	Если СписокСотрудников = Неопределено ИЛИ ТипЗнч(СписокСотрудников) = Тип("СписокЗначений") Тогда
	Оплаты.Очистить();
	ДанныеОплат = ПрямыеВыплатыПособийСоциальногоСтрахования.ДанныеЗаполненияЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов(Месяц, ФондСоциальногоСтрахования, Организация, СписокСотрудников, Ссылка, ,РежимЗаполнения);
	Если ДанныеОплат <> Неопределено Тогда
		Оплаты.Загрузить(ДанныеОплат.Выгрузить());
	КонецЕсли;
	ИначеЕсли ТипЗнч(СписокСотрудников) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТабличнаяЧасть = Оплаты.НайтиСтроки(Новый Структура("Сотрудник", СписокСотрудников));
		Для каждого Стр Из ТабличнаяЧасть Цикл
			Оплаты.Удалить(Стр.НомерСтроки - 1);
		КонецЦикла;
		Список = Новый СписокЗначений;
		Список.Добавить(СписокСотрудников);
		ДанныеПособий = ПрямыеВыплатыПособийСоциальногоСтрахования.ДанныеЗаполненияЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов(Месяц, ФондСоциальногоСтрахования, Организация, Список, Ссылка,РежимЗаполнения);
		Для каждого Строка ИЗ ДанныеПособий.Выгрузить() Цикл 
			НовЗапись = Оплаты.Добавить();
			ЗаполнитьЗначенияСвойств(НовЗапись, Строка);
		КонецЦикла;	
	КонецЕсли;
	Оплаты.Сортировать("Сотрудник Возр");
	
КонецПроцедуры

Процедура ЗаполнитьДокументПособия(СписокСотрудников) Экспорт
	
	
	Если СписокСотрудников = Неопределено ИЛИ ТипЗнч(СписокСотрудников) = Тип("СписокЗначений") Тогда
		ПособияНаПогребение.Очистить();
		ДанныеПособий = ПрямыеВыплатыПособийСоциальногоСтрахования.ДанныеЗаполненияРасходовНаПогребение(Месяц, ФондСоциальногоСтрахования, Организация, СписокСотрудников, Ссылка);
		Если ДанныеПособий <> Неопределено Тогда
			ПособияНаПогребение.Загрузить(ДанныеПособий.Выгрузить());
		КонецЕсли;
	ИначеЕсли ТипЗнч(СписокСотрудников) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТабличнаяЧасть = ПособияНаПогребение.НайтиСтроки(Новый Структура("Сотрудник", СписокСотрудников));
		Для каждого Стр Из ТабличнаяЧасть Цикл
			ПособияНаПогребение.Удалить(Стр.НомерСтроки - 1);
		КонецЦикла;
		Список = Новый СписокЗначений;
		Список.Добавить(СписокСотрудников);
		ДанныеПособий = ПрямыеВыплатыПособийСоциальногоСтрахования.ДанныеЗаполненияРасходовНаПогребение(Месяц, ФондСоциальногоСтрахования, Организация, Список, Ссылка);
		Для каждого Строка ИЗ ДанныеПособий.Выгрузить() Цикл 
			НовЗапись = ПособияНаПогребение.Добавить();
			ЗаполнитьЗначенияСвойств(НовЗапись, Строка);
		КонецЦикла;	
	КонецЕсли;
	ПособияНаПогребение.Сортировать("Сотрудник Возр");
	
КонецПроцедуры

Функция ДанныеСтроки(ДокументОснование = Неопределено, ТабличнаяЧасть, Сотрудник) Экспорт
	
	СписокСотрудников = Новый СписокЗначений;
	СписокСотрудников.Добавить(Сотрудник);
	Если ТабличнаяЧасть = "Оплаты" Тогда
		Данные = ПрямыеВыплатыПособийСоциальногоСтрахования.ДанныеЗаполненияЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов(Месяц, ФондСоциальногоСтрахования, Организация, СписокСотрудников, Ссылка, ДокументОснование,РежимЗаполнения);
	ИначеЕсли ТабличнаяЧасть = "ПособияНаПогребение" Тогда
		Данные = ПрямыеВыплатыПособийСоциальногоСтрахования.ДанныеЗаполненияРасходовНаПогребение(Месяц, ФондСоциальногоСтрахования, Организация, СписокСотрудников, Ссылка, ДокументОснование);
	КонецЕсли;	
	ДанныеСтроки = Данные.Выбрать();
	Если ДанныеСтроки.Следующий() Тогда
		Возврат ДанныеСтроки
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Ссылка.СтатусДокумента = Перечисления.СтатусыЗаявленийИРеестровНаВыплатуПособий.ПереданВФСС Тогда	
		ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		ДанныеДляПроведения = ДанныеДляПроведения(ЭтотОбъект.Ссылка);
		ДвижениеПоРегиструРасчетыСФондамиПоПособиям(ДанныеДляПроведения, Движения, Ссылка);
	Иначе
		Запись = РегистрыНакопления.РасчетыСФондамиПоПособиям.СоздатьНаборЗаписей();
		Запись.Отбор.Регистратор.Установить(Ссылка);
		Запись.Очистить();
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ДвижениеПоРегиструРасчетыСФондамиПоПособиям(Данные, Движения, Ссылка)
	
	Для Каждого Строка ИЗ Данные.Больничные Цикл
		НовыеДвижения = Движения.РасчетыСФондамиПоПособиям.Добавить();
		ЗаполнитьЗначенияСвойств(НовыеДвижения,Строка);
	КонецЦикла;
	Для Каждого Строка ИЗ Данные.ПособияНаПогребения Цикл
		НовыеДвижения = Движения.РасчетыСФондамиПоПособиям.Добавить();
		ЗаполнитьЗначенияСвойств(НовыеДвижения,Строка);
	КонецЦикла;
	Движения.РасчетыСФондамиПоПособиям.Записывать = Истина;
	Движения.РасчетыСФондамиПоПособиям.Записать();
	
КонецПроцедуры


Функция ДанныеДляПроведения(ЭтотОбъект)
	
	ДанныеДляПроведения = Новый Структура;
	Если ЭтотОбъект.Оплаты.Количество() > 0 Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявлениеРасчетВФСС.Организация,
		|	ЗаявлениеРасчетВФСС.Месяц,
		|	ЗаявлениеРасчетВФСС.Ссылка КАК Заявление,
		|	ЗаявлениеРасчетВФСС.ФондСоциальногоСтрахования,
		|	ЗаявлениеРасчетВФССОплаты.Сотрудник,
		|	ЗаявлениеРасчетВФССОплаты.СуммаПособияВсегоФСС КАК Сумма,
		|	ЗаявлениеРасчетВФССОплаты.КоличествоДнейВсегоФСС КАК КоличествоДней,
		|	ЗаявлениеРасчетВФССОплаты.СуммаЛьготыЧернобыльцы,
		|	ЗаявлениеРасчетВФССОплаты.ДокументОснование,
		|	ЗаявлениеРасчетВФССОплаты.ПричинаНетрудоспособности,
		|	ЗаявлениеРасчетВФСС.Ссылка КАК Регистратор,
		|	ЗаявлениеРасчетВФСС.Дата КАК Период
		|ПОМЕСТИТЬ Оплаты
		|ИЗ
		|	Документ.ЗаявлениеРасчетВФСС.Оплаты КАК ЗаявлениеРасчетВФССОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеРасчетВФСС КАК ЗаявлениеРасчетВФСС
		|		ПО ЗаявлениеРасчетВФССОплаты.Ссылка = ЗаявлениеРасчетВФСС.Ссылка
		|ГДЕ
		|	ЗаявлениеРасчетВФССОплаты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплаты.Организация,
		|	Оплаты.Месяц,
		|	Оплаты.Заявление,
		|	Оплаты.ФондСоциальногоСтрахования,
		|	Оплаты.Сотрудник,
		|	Оплаты.Сумма,
		|	Оплаты.КоличествоДней,
		|	Оплаты.СуммаЛьготыЧернобыльцы,
		|	Оплаты.ДокументОснование,
		|	Оплаты.ПричинаНетрудоспособности,
		|	НастройкаРасчетовСФондамиПоПособиям.СтатьяРасчетов,
		|	Оплаты.Регистратор,
		|	Оплаты.Период
		|ИЗ
		|	Оплаты КАК Оплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаРасчетовСФондамиПоПособиям КАК НастройкаРасчетовСФондамиПоПособиям
		|		ПО Оплаты.ФондСоциальногоСтрахования = НастройкаРасчетовСФондамиПоПособиям.ФондСоциальногоСтрахования
		|			И Оплаты.ПричинаНетрудоспособности = НастройкаРасчетовСФондамиПоПособиям.Пособие
		|";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект);
		
		ДанныеДляПроведения.Вставить("Больничные", Запрос.Выполнить().Выгрузить());
	Иначе
		ДанныеДляПроведения.Вставить("Больничные", Новый ТаблицаЗначений);
	КонецЕсли;	
	Если ЭтотОбъект.ПособияНаПогребение.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявлениеРасчетВФСС.Организация,
		|	ЗаявлениеРасчетВФСС.Месяц,
		|	ЗаявлениеРасчетВФСС.Ссылка КАК Заявление,
		|	ЗаявлениеРасчетВФСС.Ссылка КАК Регистратор,
		|	ЗаявлениеРасчетВФСС.ФондСоциальногоСтрахования,
		|	ЗаявлениеРасчетВФССПособияНаПогребение.Сотрудник,
		|	ЗаявлениеРасчетВФССПособияНаПогребение.ДокументОснование,
		|	ЗаявлениеРасчетВФССПособияНаПогребение.РазмерПособия КАК Сумма,
		|	0 КАК КоличествоДней,
		|	0 КАК СуммаЛьготыЧернобыльцы,
		|	ЗаявлениеРасчетВФСС.Дата КАК Период
		|ПОМЕСТИТЬ Оплаты
		|ИЗ
		|	Документ.ЗаявлениеРасчетВФСС.ПособияНаПогребение КАК ЗаявлениеРасчетВФССПособияНаПогребение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеРасчетВФСС КАК ЗаявлениеРасчетВФСС
		|		ПО ЗаявлениеРасчетВФССПособияНаПогребение.Ссылка = ЗаявлениеРасчетВФСС.Ссылка
		|ГДЕ
		|	ЗаявлениеРасчетВФССПособияНаПогребение.Ссылка = &Ссылка
		|	И НЕ ЗаявлениеРасчетВФССПособияНаПогребение.ПособиеСтороннемуЛицу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплаты.Организация,
		|	Оплаты.Месяц,
		|	Оплаты.Заявление,
		|	Оплаты.ФондСоциальногоСтрахования,
		|	Оплаты.Сотрудник,
		|	Оплаты.ДокументОснование,
		|	Оплаты.Сумма,
		|	Оплаты.КоличествоДней,
		|	Оплаты.СуммаЛьготыЧернобыльцы,
		|	НастройкаРасчетовСФондамиПоПособиям.СтатьяРасчетов,
		|	Оплаты.Регистратор,
		|	Оплаты.Период
		|ИЗ
		|	Оплаты КАК Оплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаРасчетовСФондамиПоПособиям КАК НастройкаРасчетовСФондамиПоПособиям
		|		ПО Оплаты.ФондСоциальногоСтрахования = НастройкаРасчетовСФондамиПоПособиям.ФондСоциальногоСтрахования
		|			И (НастройкаРасчетовСФондамиПоПособиям.Пособие = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ПособиеНаПогребение))";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект);
		ДанныеДляПроведения.Вставить("ПособияНаПогребения", Запрос.Выполнить().Выгрузить());
	Иначе
		ДанныеДляПроведения.Вставить("ПособияНаПогребения",Новый ТаблицаЗначений);
	КонецЕсли;	
	Возврат ДанныеДляПроведения; 
	
КонецФункции	

#КонецОбласти

#КонецЕсли
